{
	"version_name": "2.3.3",
	"build_number": 183,
	"title": "General Fixes and Improvements",
	"changelog": "The Github Repo Has been made to require an account downloads are on mega until this is resolved. \n 2.3.3: If you encounter any issues, please report them in github issues or in our discord server\n\n\nNew features:\n- Updated Flutter and dependencies\n- Improved search in tabs manager by moving all filtering away from text field into a separate menu + added a new [Duplicates] filter\n- Share button now shows download progress and tapping it while there is an active download will give you options to stop the current download or replace it with a new one\n- Since Realbooru API doesn't give correct file extensions, app will now try to guess them by making multiple requests to their servers to get the extension, if possible. This approach can lead to some issues, report us any bugs or problems\n- Added a button to go directly to a created tab from a notification after pressing [New] button in gallery tags drawer\n- Webview cache can now be cleared\n- Added Support for wildcritters\n\n\nFixes:\n- Fixed a crash when restoring backup from a huge (50mb+) database file\n- Fixed encoding when searching tags with special characters (i.e. &)\n- If request triggered a captcha check it will try to load again after exiting the webview\n- All requests (except for a few boorus) now use app useragent string instead of a browser one\n- Added a setting in [Snatching and Caching] to set a custom useragent string, please note that some cloudflare protected sites could have problems with useragents from normal browsers\n- Renamed [User ID] to [Login] for Danbooru to avoid confusion\n- Fixed [Write Image Data to JSON] setting causing issues with saving on Android 13\n- Fixed Sample quality setting not being used\n- Fixed [Default tags] setting inside a booru config not being used\n\n\nand other small changes and fixes...",
	"is_in_store": true,
	"is_important": false,
	"store_package": "com.noaisu.play.loliSnatcher",
	"github_url": "https://mega.nz/folder/lXx1jSzL#24WPIcXTFOYgRX76v-1G3w",
	"discord_url": "https://discord.gg/r9E4HDx9dz"
}