{
	"version_name": "2.1.0-Hotfix2",
	"build_number": 168,
	"title": "New Features and Booru fixes",
	"changelog": "Main changes:\n- Gelbooru fixed\n- Comments support\n- Notes support\n- Config sharing\n- Performance improvements\n\n[Note] This update was forced to release early due to Gelbooru changing their api. If you will encounter any bugs or issues, please create an issue on Github.\n\nNew Features:\n- Added comments reader [Available on Sankaku, Gelbooru, Danbooru, Shimmie]\n- Added notes overlay [Available on Sankaku, Gelbooru. Support for more boorus will be added later]\n-- [Buttons for them will appear in info/tags drawer]\n- Appbar will now hide when scrolling\n- You can now share your booru config with others using special links, use share button in booru settings\n- Lolisync now allows to sync your tabs between devices and skip custom amount of favourited items\n- Lolisync now shows last 10 completed actions\n- Added buttons to quickly change current item in gallery [Disabled by default, enable in Gallery settings]\n- Added buttons to every text input field to allow quick save/clear/reset of text + numeric fields can have increment/decrement buttons for quick editing (+ they support long press)\n- Added a dialog to jump to/search until specific page (Placed on the main appbar)\n- Long press on main drawer button will scroll to top\n- Long press on source will copy it\n- Buttons to add/remove/exclude tag from current search in tag dialog\n- Long press on new tab button of a tag will sent you directly to newly created tab\n- Added site filter for Favourites (Example: 'site:chan' will find all items with chan in their post url)\n- Added a button to collapse \"You Reached the End\" message\n\nFixes:\n- Updated flutter and dependencies to their latest versions\n- App now supports splitscreen view with other apps on android\n- Fixed gelbooru parser\n- Fixed r34hentai parser\n- Improved local db query performance\n- Booru test will now show reason why it failed\n- Fixed selectors not scrolling to the current item properly\n- Rewrote some parts of the app to improve performance\n- Improved scroll performance of some widgets\n- Fixed color issues on some widgets when using Light theme\n- Lolisync now defaults to 8080 port\n- Media now will not auto-download if it's bigger than 200mb\n- Added placeholder for unsupported file formats\n- Fixed tag autocomplete for .xyz/.world\n- Improved snatch status messages\n- Fixed errors when editing booru config\n- Fixed some parts not resizing properly if app viewport size changed\n- Keyboard quick action '_' will now add a symbol at a current cursor position, not at the end\n\n- Other small fixes...",
	"is_in_store": true,
	"is_update_in_store": true,
	"is_important": false,
	"store_package": "com.noaisu.play.loliSnatcher",
	"github_url": "https://github.com/NO-ob/LoliSnatcher_Droid/releases/latest"
}
