{
	"version_name": "2.4.1",
	"build_number": 191,
	"title": "2.4.1",
	"changelog": "If you encounter any issues, please report them in github issues or in our discord server\n\n[Note] Starting from this version only devices on Android 6 and up are supported\n\n\nMain changes in this release:\n- Alternative video player backend\n- Proxy support\n- Fixes for Paheal and Sankaku\n- Ability to cancel downloads\n- Tabs manager filter improvements\n\n-------------------\n\nNew Features:\n- Alternative video player backend [Settings->Video]. Has better performance, but may need tinkering with settings depending on booru/device to work properly. Based on media_kit package\n- Proxy support [Settings->Network]. Beta, doesn't apply to videos on stream mode\n- Added a dialog with detailed options of how new tab will be added. Can be opened by long pressing the \"Add new tab\" button (the one with the plus icon) in the main drawer\n- Added ability to filter tabs by tag type and multibooru status\n- Added ability to sort by booru in tabs manager\n- Added a setting in [Settings->Privacy] to set keyboard to Incognito mode (will tell keyboard to disable learning based on your input)\n- Added a button in Viewer toolbar to open videos in external players\n- Item data on r34xxx will now update when opening the tag drawer in the Viewer. If it fails, you may need to complete a captcha by manually refreshing the data (refresh button is in the Tags section header)\n- Added ability to manually edit tag type in the dialog with tag info\n- Added ability to cancel current download\n- Added progress indicator on thumbnails of currently downloading items\n- Added a button in main drawer to quickly open webview for current booru, useful for retrying captchas without needing to load next page\n- Added page up/down buttons on thumbnails grid. Disabled by default, can be enabled in [Settings->Interface]\n- Added a Halloween theme 👻\n\n\nChanges:\n- Updated to latest version of Flutter and all of the dependencies\n- Completely switched to Material3 design, removed the setting to switch between v2 and v3\n- Improved zoom gestures logic, removed setting to disable some zoom gestures\n- Moved some settings to new or different pages\n- Improved wording of some descriptions\n- Renamed [Gallery] to [Viewer]\n- Changed the Viewer page change animation, can be changed back to old one in [Settings->Viewer]\n- Booru tab filter will now show only boorus with at least 1 tab available\n- Added icon on thumbnail if item has user comments\n- Added copy/paste buttons on some text fields\n- Text fields with sensitive data (i.e. passwords) are now obscured by default\n- Increased search history limit to 10k\n- Replaced setting dropdowns with lists if there are only 2-3 options\n- Videos will restart in cache mode automatically if initial buffering takes more than 10 seconds on videos smaller than 25mb\n- Error info in thumbnails grid can now be collapsed\n- Redesigned downloads cards a bit\n- Tab backups will now keep and restore multibooru status\n- Tab backups now use json format\n- Multibooru will now let you pick which secondary boorus you want to use before running a search\n- Updated logger ui\n- Automatic search until a set page (started in Page changer) can now be ended early\n- App will try to guess any unknown file type extension when in Viewer\n- Removed thumbnail animation when opening/closing comments\n- Added a setting to favourite an item on snatching in [Settings->Snatching & Caching]\n- Added a setting to disable vibration in [Settings->Interface]\n- Added support for monochrome launcher icons (current icon is a placeholder, better design will be added in future versions)\n\n\nFixes:\n- Fixed parsing of Paheal, Normal and Idol Sankaku\n- Tags on sankaku are now sorted alphabetically\n- Fixed ghosting issues on some scrollable elements\n- Fix video player controls not responding to taps on top of the screen\n- Attempt to prevent opening multiple viewers at once\n- Fixed some dialogs overlapping with system ui\n- Fixed zoom gestures conflicting with double tap on videos on some devices\n- R34hentai should now properly detects when cookies are expired and tries to update them automatically\n- Fixed share booru deeplink not parsing in some cases, causing grey screen when opening it\n- Fixed cookie cleaner not working in some cases\n- Fixed booru favicons not rendering correctly for some boorus\n- Fixed database backup restore crashing if file is too big\n- Restore page will be locked up until current operation is completed to avoid data corruption from multiple actions running at once\n- Added a root certificate, should fix cert errors for older devices. If you had these errors before, you can now disable [Settings->Network->Enable self signed SSL certificates]\n- If Viewer is open and device changed rotation (i.e. opened video in fullscreen), app will try to restore previous scroll position\n- Fixed loading state in some cases ending while the loading is actually still in progress, causing the \"No data loaded\" message\n- Fixed forcing https when opening custom urls in webview\n\n\nand a lot of other fixes and changes...",
	"is_in_store": false,
	"is_important": false,
	"store_package": "com.noaisu.play.loliSnatcher",
	"github_url": "https://github.com/NO-ob/LoliSnatcher_Droid/releases/tag/2.4.1",
	"discord_url": "https://discord.gg/r9E4HDx9dz"
}